Revit 2027 API
AreaVolumeSettings.GetSpatialElementBoundaryLocation Method
 Gets the spatial element boundary location based on spatial element type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpatialElementBoundaryLocation GetSpatialElementBoundaryLocation(
	SpatialElementType spType
)
Public Function GetSpatialElementBoundaryLocation (
	spType As SpatialElementType
) As SpatialElementBoundaryLocation
public:
SpatialElementBoundaryLocation GetSpatialElementBoundaryLocation(
	SpatialElementType spType
)
member GetSpatialElementBoundaryLocation :
        spType : SpatialElementType -> SpatialElementBoundaryLocation
Parameters
spType SpatialElementType
 The spatial element type.
Return Value
SpatialElementBoundaryLocation
 The boundary location.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace